---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.MultipleValuesIndicatorOption
source: html/e1cfec20-7572-6578-ba2a-e9b7a308daae.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.MultipleValuesIndicatorOption Property

Identifies how the Bending Detail will represent the varying rebar dimensions.

## Syntax (C#)
```csharp
public BendingDetailCustomFieldMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration